{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "The perfect leg workout must consist of compound exercises for the quads, glutes and hamstrings while not overlooking the smaller muscles of the hips and our ability to train in all three planes.  In this leg workout, you will find that we overlook no component of upper leg training and get you training like an athlete in the process.

As with all videos in this perfect workout series, the goal here is to make sure you will build not only size by following these leg exercises but strength and explosiveness as well.  This starts as always with a compound movement for the legs, and there is none better than the squat.  While warming up to perform the squat the key is not to exhaust yourself more than necessary.  Too many times, people perform too many warmups, cutting into energy reserves for their working sets.

What you should do instead, is do a few reps with your sub-working weight to loosen up your joints. Just before starting your first work set, perform one touch-up set with about 10 percent more than what you will be using for your workout.  Perform just 1 to 2 reps here to prepare the nervous system and neurologically “lighten” the load that is to come.

Work your way from sets of 5 to a set of 25 grueling reps on the squats before moving onto the next component of this leg workout; the posterior chain compound exercise.

Here you have two choices.  You can either do the barbell hip thrust or the glute ham raise.  Keep in mind, because you will be able to significantly load the barbell hip thrust more than you will the glute ham raise, you will want to opt for this exercise if your main goal is training for strength.  That said, if you are looking to get more active engagement of the hamstrings through their concentric range of motion, then you will want to do the GHR since it contributes in areas that the hip thrust only isometrically challenges.

The next exercise is the hi/low dumbbell bulgarian split squat.  This is a necessary component of any athletic lower body training approach because it is a unilateral exercise.  Not only do the dynamic stability benefits shine through here but it challenges the body in the frontal plane in ways that traditional bilateral training via squats cannot do.  Alternate the position of your torso on each rep to ensure you hit both the quads and the glutes more effectively on each rep.

The TKE Drop Lunge is a great way to ensure resistance through terminal knee extension.  Now, it is important that you understand that there is no way to isolate the medial or inner portion of the quads during an exercise.  What you can do however is ensure that this separately innervated head of the quads gets full stimulation by going to a full lockout position of extension on every rep.  We can overload that with the addition of the band as well.

Next, no perfect leg workout would be complete without the additional focus on the inside and outside of our legs.  The adductors are hit tremendously well with the Goblet Adductor Lunge shown in this video.  Don’t just step back up to the top, but slide or squeeze your legs together to get yourself back to a standing position.  This will light up the all important adductor muscles on the inside of your thighs and help you to build the strength needed.

Finally, you have to hit the outside abductors of your legs as well.  This can be accomplished with the finisher shown.  The hip band ladder requires that you work your way up to 10 reps in each direction of a side step while making sure to keep your toes pointed straight ahead at all times.  This will strengthen the outside of your legs, which is an area that tends to be very weak.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FLowerBody%2FThe%20PERFECT%20Leg%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=4d1371b6-dd30-4f2f-9f40-57efa48b3a47" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnaillower.jpg?alt=media&token=99486517-a3a4-4dfa-b67d-2657afcebd04",
      "title" : "The PERFECT Leg Workout "
    }, {
      "description" : "If you have been looking for a leg workout to build bigger legs, then you need to watch these 5 tips that can apply to any workout for legs. It isn’t always about the split that you are doing that determines how big your quads and hamstrings are going to become. Instead, it’s the way you perform your leg exercises and how you load the exercises you are performing that can make a difference in the results you see.

For this, we showcase a real hardgainer for leg development - Jesse. As you may remember, when Jesse first appeared on the channel he was extremely skinny and found it difficult to build muscle anywhere let alone on his legs. He tried everything. Heavy squatting. Two a days. High volume. None of it seemed to work when it came to building bigger legs. That is when I shared with him 5 leg workout tips for building bigger legs that have changed his development substantially and can do the same for you.

The first thing we addressed was something that was actually contrary to one of the methods I grew up admiring - the heavy duty method. There it was recommended that when someone was training natural that one of the easiest ways to spark new growth in a stubborn muscle was to drop the volume and spread out the number of days between leg workouts. Of course, the intensity would have to be higher to account for this decreased volume. 

That said, what I find as a prerequisite for sparking new leg muscle growth however is the opposite. If your legs just won’t grow, the first thing I suggest is adding a leg workout to your weekly training split. If you are doing a push pull legs or a total body workout, just add a leg day to the weekend. Remember, with the additional volume presented by this leg day you might have to potentially lighten up a bit on the legs in that last total body session of the week.

Next tip is to flip the script on your leg training and stop focusing just on doing heavy squats and lighter accessory lifts. In fact, if you haven’t done light squats and high rep squats before this is exactly the change that is bound to spark the most gains by doing so. Add a couple 15, 20 or even 25 reps sets of squats into your leg training and you will see a huge difference in the size of your legs. On the other hand, instead of just doing light lunges and bulgarian split squats, opt to train these leg exercises heavy for just the spark you need for more growth.

If you aren’t doing lunges, I am highly recommending that you do. There is nothing better to compliment a well designed leg workout than a few sets of lunges. I prefer to do these in the reverse direction since it takes some of the load off the knees. The key to their inclusion is that they are an athletic application of training that can’t be overlooked, and they relieve people of ankle and hip mobility issues that may make squatting alone quite difficult.

Next, you want to be sure you’re including glute ham raises for your posterior chain development. You don’t need to have a GHR machine to do this leg exercise. Instead, you can anchor your feet under a couch or bed and get the same benefit. When the exercise feels like it is becoming too easy you can grab a plate and do them with additional weight across your chest.

Finally, as a hardgainer you can’t neglect the importance of eating and sleep for optimal recovery. Especially if you are going to be adding a leg day to your current training split, the fact that leg training can be so taxing on your body makes it even more important that you have the other important elements of recovery in place. Eat smaller meals more frequently if you find it challenging to eat enough, and go to bed a little earlier at night if you find your sleep is restless.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FLowerBody%2FLeg%20Workout%20Tips%20for%20Bigger%20Legs%20(HARDGAINERS!).mp4?alt=media&token=eae8ee7d-4f09-4ea9-8efb-03b281462336" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnaillower.jpg?alt=media&token=99486517-a3a4-4dfa-b67d-2657afcebd04",
      "title" : "Leg Workout Tips for Bigger Legs"
    }, {
      "description" : "If you want to develop six pack abs you may think that you have to spend hours a day trying to get one.  That is not the case at all.  If you are able to commit to a consistent but short effort you will be amazed at how much better your abs could look in a short period of time when combined with a focused attention to what you eat as well.

In this video, I have a short 7 minute ab workout for you to do along with me.  As you will see and feel, an ab workout does not have to be long to be effective.  As a matter of fact, I would probably say that the longer the ab workout goes, the less effective it becomes.  The key to this working is that it is short enough to allow you to do it on a regular basis without having to fight to schedule it into your day.

Remember, the key to getting a six pack is consistency.  Now, don’t think that just because you might be doing the same set of exercises that it is becoming less effective.  It is not.  The choice of ab exercises in this workout is broad enough so as to cover all of the major functions of the abs.  There are bottom up movements that better hit the lower abs.  There are rotational movements that are initiated from the bottom up and the top down to really hit the rotation capabilities of the core muscles.

There are also top down movements where the shoulders are lifted off of the ground as opposed to the legs, which are situated at the end of the workout to allow you to keep training your abs when they are fatigued.  When there are purposeful ab exercises in your workouts they do not have to be long.

The point of this video is to give you a follow along ab workout that you can do anywhere.  There are no special pieces of equipment needed to do this.  All you need is your body and some space on the floor.  You might actually need a bit more than that, and that would be a heavy dose of determination to try and resist the burn of these exercises as you do them.  Remember, the pain from ab training is usually only temporary.  As soon as finish the exercise and the lactic acid starts to clear the abdominal muscles, you feel normal again.

See if you can follow the entire ab workout along with me, resting when I do.  If you need extra rest for some reason, don’t be bashful - take it.  Maybe you can only do 40 seconds of one of the 60 second exercises.  That’s ok, do what you can and rest for the remainder of that exercise.  As you get stronger on these you will be able to do the whole thing without extra rest.  Here is the ab workout as follows:

Seated Ab Circles Left x 60 seconds
Seated Ab Circles Right x 60 seconds
Drunken Mountain Climbers x 60 seconds
Rest 30 seconds
Marching Planks x 60 seconds
Scissors x 60 seconds
Starfish Crunch x 30 seconds
Rest 30 seconds
Russian V Tuck Twists x 30 seconds",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FLowerBody%2FIntense%20Ab%20Workout%207%20Minutes%20(FOLLOW%20ALONG!).mp4?alt=media&token=87a91e47-70c9-4ccd-842a-eb9e3166edfa" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnailabs.jpeg?alt=media&token=56013544-9f6f-4367-8c7d-6460bb213145",
      "title" : "Intense Ab Workout 7 Minutes "
    } ]
  } ]
}
